channelWithObstacle/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          20;
        startFace       3653;
    }
    outlet
    {
        type            patch;
        nFaces          27;
        startFace       3673;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          87;
        startFace       3700;
    }
    upperWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          80;
        startFace       3787;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          3760;
        startFace       3867;
    }
)

// ************************************************************************* //
